Revit 2024 API
FabricationRodInfo.AttachToHanger Method
 Attaches the hanger rod to another bearer hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void AttachToHanger(
	ElementId hangerId,
	int rodIndex,
	XYZ position
)
Visual Basic
Public Sub AttachToHanger ( _
	hangerId As ElementId, _
	rodIndex As Integer, _
	position As XYZ _
)
Visual C++
public:
void AttachToHanger(
	ElementId^ hangerId,
	int rodIndex,
	XYZ^ position
)
Parameters
hangerId
Type: Autodesk.Revit.DB.ElementId
 Identifier of the bearer hanger to which the rod attaches.
rodIndex
Type: System.Int32
 The index of the rod.
position
Type: Autodesk.Revit.DB.XYZ
 The position of the rod end. It should be on bearer centerline.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The hanger is not a bearer hanger. -or- The point is not on hanger bearer centerline.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace